; domain
(define (domain logistics-strips)
  (:requirements :strips :constraints)
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c3-s4-p8-a2)
(:domain logistics-strips)
(:objects a0 a1 
          c0 c1 c2 
          t0 t1 t2 
          l0-0 l0-1 l0-2 l0-3 l1-0 l1-1 l1-2 l1-3 l2-0 l2-1 l2-2 l2-3 
          p0 p1 p2 p3 p4 p5 p6 p7 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l0-3)
    (in-city  l0-3 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l1-3)
    (in-city  l1-3 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (LOCATION l2-3)
    (in-city  l2-3 c2)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (at t0 l0-2)
    (at t1 l1-3)
    (at t2 l2-3)
    (at p0 l2-0)
    (at p1 l0-0)
    (at p2 l1-0)
    (at p3 l2-3)
    (at p4 l1-1)
    (at p5 l1-0)
    (at p6 l2-3)
    (at p7 l0-3)
    (at a0 l0-0)
    (at a1 l1-0)
)
(:goal
    (and
        (at p0 l2-0)
        (at p1 l0-3)
        (at p2 l1-3)
        (at p3 l0-3)
        (at p4 l1-3)
        (at p5 l0-1)
        (at p6 l1-0)
        (at p7 l0-1)
    )
)
)

; plan
1. (fly-airplane a0 l0-0 l1-0)
   deleted: (at a0 l0-0)
   added: (at a0 l1-0)
   goals met: 1 of 8
2. (drive-truck t0 l0-2 l0-3 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-3)
   goals met: 1 of 8
3. (load-airplane p5 a1 l1-0)
   deleted: (at p5 l1-0)
   added: (in p5 a1)
   goals met: 1 of 8
4. (load-truck p6 t2 l2-3)
   deleted: (at p6 l2-3)
   added: (in p6 t2)
   goals met: 1 of 8
5. (load-truck p3 t2 l2-3)
   deleted: (at p3 l2-3)
   added: (in p3 t2)
   goals met: 1 of 8
6. (drive-truck t1 l1-3 l1-1 c1)
   deleted: (at t1 l1-3)
   added: (at t1 l1-1)
   goals met: 1 of 8
7. (load-truck p7 t0 l0-3)
   deleted: (at p7 l0-3)
   added: (in p7 t0)
   goals met: 1 of 8
8. (fly-airplane a1 l1-0 l0-0)
   deleted: (at a1 l1-0)
   added: (at a1 l0-0)
   goals met: 1 of 8
9. (drive-truck t2 l2-3 l2-0 c2)
   deleted: (at t2 l2-3)
   added: (at t2 l2-0)
   goals met: 1 of 8
10. (load-truck p4 t1 l1-1)
   deleted: (at p4 l1-1)
   added: (in p4 t1)
   goals met: 1 of 8
11. (fly-airplane a0 l1-0 l2-0)
   deleted: (at a0 l1-0)
   added: (at a0 l2-0)
   goals met: 1 of 8
12. (unload-truck p6 t2 l2-0)
   deleted: (in p6 t2)
   added: (at p6 l2-0)
   goals met: 1 of 8
13. (unload-airplane p5 a1 l0-0)
   deleted: (in p5 a1)
   added: (at p5 l0-0)
   goals met: 1 of 8
14. (drive-truck t1 l1-1 l1-0 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 1 of 8
15. (drive-truck t0 l0-3 l0-1 c0)
   deleted: (at t0 l0-3)
   added: (at t0 l0-1)
   goals met: 1 of 8
16. (unload-truck p3 t2 l2-0)
   deleted: (in p3 t2)
   added: (at p3 l2-0)
   goals met: 1 of 8
17. (load-truck p2 t1 l1-0)
   deleted: (at p2 l1-0)
   added: (in p2 t1)
   goals met: 1 of 8
18. (load-airplane p6 a0 l2-0)
   deleted: (at p6 l2-0)
   added: (in p6 a0)
   goals met: 1 of 8
19. (unload-truck p7 t0 l0-1)
   deleted: (in p7 t0)
   added: (at p7 l0-1)
   goals met: 2 of 8
20. (fly-airplane a1 l0-0 l2-0)
   deleted: (at a1 l0-0)
   added: (at a1 l2-0)
   goals met: 2 of 8
21. (drive-truck t1 l1-0 l1-3 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-3)
   goals met: 2 of 8
22. (fly-airplane a0 l2-0 l1-0)
   deleted: (at a0 l2-0)
   added: (at a0 l1-0)
   goals met: 2 of 8
23. (load-airplane p3 a1 l2-0)
   deleted: (at p3 l2-0)
   added: (in p3 a1)
   goals met: 2 of 8
24. (drive-truck t0 l0-1 l0-0 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 2 of 8
25. (unload-truck p4 t1 l1-3)
   deleted: (in p4 t1)
   added: (at p4 l1-3)
   goals met: 3 of 8
26. (unload-truck p2 t1 l1-3)
   deleted: (in p2 t1)
   added: (at p2 l1-3)
   goals met: 4 of 8
27. (unload-airplane p6 a0 l1-0)
   deleted: (in p6 a0)
   added: (at p6 l1-0)
   goals met: 5 of 8
28. (fly-airplane a1 l2-0 l0-0)
   deleted: (at a1 l2-0)
   added: (at a1 l0-0)
   goals met: 5 of 8
29. (load-truck p5 t0 l0-0)
   deleted: (at p5 l0-0)
   added: (in p5 t0)
   goals met: 5 of 8
30. (load-truck p1 t0 l0-0)
   deleted: (at p1 l0-0)
   added: (in p1 t0)
   goals met: 5 of 8
31. (unload-airplane p3 a1 l0-0)
   deleted: (in p3 a1)
   added: (at p3 l0-0)
   goals met: 5 of 8
32. (load-truck p3 t0 l0-0)
   deleted: (at p3 l0-0)
   added: (in p3 t0)
   goals met: 5 of 8
33. (drive-truck t0 l0-0 l0-3 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-3)
   goals met: 5 of 8
34. (unload-truck p3 t0 l0-3)
   deleted: (in p3 t0)
   added: (at p3 l0-3)
   goals met: 6 of 8
35. (unload-truck p1 t0 l0-3)
   deleted: (in p1 t0)
   added: (at p1 l0-3)
   goals met: 7 of 8
36. (drive-truck t0 l0-3 l0-1 c0)
   deleted: (at t0 l0-3)
   added: (at t0 l0-1)
   goals met: 7 of 8
37. (unload-truck p5 t0 l0-1)
   deleted: (in p5 t0)
   added: (at p5 l0-1)
   goals met: 8 of 8
